* 10.04 Fold right
  We call ~foldr~ "Fold right" because the fold is right associative
  #+BEGIN_SRC haskell :eval never
  foldr :: (a -> b -> b) -> b -> [a] -> b
  foldr f z [] = z
  foldr f z (x:xs) = f x (foldr f z xs)
  #+END_SRC

  Example of execution
  #+BEGIN_EXAMPLE
  foldr (+) 0 [1, 2, 3]
  (+) 1 (foldr (+) 0 [2, 3])
  (+) 1 ((+) 2 (foldr (+) 0 [3]))
  (+) 1 ((+) 2 ((+) 3 (foldr (+) 0 [])))
  (+) 1 ((+) 2 ((+) 3 0))
  (+) 1 ((+) 2 3)
  (+) 1 5
  6
  #+END_EXAMPLE

  - Folding happens in two stages: /traversing/ and /folding/
    - /Traversing/ is the stage in which the fold recurses over the spine.
    - /Folding/ is the stage of the evaluation or reduction of the
      function over the values.

  - Given this two stage evaluation and lazyness if the reduce
    function doesn't need to evalute the second argument (aka the rest
    of the fold) then the evaluation can stop at the first step.

  - The above reduction traverses all the spine of the list and
    evaluates all the values because ~(+)~ is strict on both
    arguments. For that ~foldr~ can be used on potentially infinite
    foldable data structures.
    #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
    :{
    myAny :: (a -> Bool) -> [a] -> Bool
    myAny f xs = foldr (\x b -> f x || b) False xs
    :}
    myAny even [1..]
    #+END_SRC

    #+RESULTS:
    #+BEGIN_EXAMPLE
    True
    #+END_EXAMPLE

  - Another term we use for this never-ending evaluation is /bottom/
    or /undefined/

  - If the function we give to ~foldr~ doesn't use the values of the
    list then we can have ~undefined~ in the list
    #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
    foldr (\_ _ -> 42) undefined [undefined]
    #+END_SRC

    #+RESULTS:
    #+BEGIN_EXAMPLE
    42
    #+END_EXAMPLE

    The above will not traverse the spine nor evaluates the arguments,
    the one below will traverse the spine but it will not evaluate the
    arguments. NOTE: we need the default value to be not ~undefined~
    #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
    foldr (\_ n -> n + 1) 0 [undefined, undefined]
    #+END_SRC

    #+RESULTS:
    #+BEGIN_EXAMPLE
    2
    #+END_EXAMPLE

* 10.05 Fold left
  We call ~foldl~ "Fold left" because the fold is left associative
  #+BEGIN_SRC haskell :eval never
  foldl :: (b -> a -> b) -> b -> [a] -> b
  foldl f acc [] = acc
  foldl f acc (x:xs) = foldl f (f acc x) xs
  #+END_SRC

  Example of execution
  #+BEGIN_EXAMPLE
  foldl (+) 0 [1, 2, 3]
  foldl (+) ((+) 1 0) [2, 3]
  foldl (+) ((+) 2 ((+) 1 0)) [3]
  foldl (+) ((+) 3 ((+) 2 ((+) 1 0))) []
  (+) 3 ((+) 2 ((+) 1 0))
  (+) 3 ((+) 2 1)
  (+) 3 3
  6
  #+END_EXAMPLE

  The result is the same as ~foldl~ but only because the operation
  ~(+)~ is associative, if the operation/function is not then there's
  a big difference
  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
  foldr (^) 2 [1, 2, 3]
  foldl (^) 2 [1, 2, 3]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  1
  64
  #+END_EXAMPLE

  Execution of ~foldr~
  #+BEGIN_EXAMPLE
  foldr (^) 2 [1, 2, 3]
  (^) 1 (foldr (^) 2 [2, 3])
  (^) 1 ((^) 2 (foldr (^) 2 [3]))
  (^) 1 ((^) 2 ((^) 3 (foldr (^) 2 [])))
  (^) 1 ((^) 2 ((^) 3 2))
  (^) 1 512
  1
  #+END_EXAMPLE

  Execution of ~foldl~
  #+BEGIN_EXAMPLE
  foldl (^) 2 [1, 2, 3]
  foldl (^) ((^) 2 1) [2, 3]
  foldl (^) ((^) ((^) 2 1) 2) [3]
  foldl (^) ((^) ((^) ((^) 2 1) 2) 3) []
  ((^) ((^) ((^) 2 1) 2) 3)
  ((^) ((^) 2 2) 3)
  ((^) 4 3)
  64
  #+END_EXAMPLE

  Sometimes you have to use ~flip~ with ~foldl~ or with ~foldr~
  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
  foldr (:) [] [1, 2, 3]
  foldl (:) [] [1, 2, 3]
  foldl (flip (:)) [] [1, 2, 3]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [1,2,3]
  <interactive>:1513:7: error:
      • Occurs check: cannot construct the infinite type: a ~ [a]
        Expected type: [a] -> [a] -> [a]
          Actual type: a -> [a] -> [a]
      • In the first argument of ‘foldl’, namely ‘(:)’
        In the expression: foldl (:) [] [1, 2, 3]
        In an equation for ‘it’: it = foldl (:) [] [1, 2, 3]
      • Relevant bindings include
          it :: [a] (bound at <interactive>:1513:1)
  [3,2,1]
  #+END_EXAMPLE

** Exercise: Database Processing

   Complete the following code
   #+NAME: Database
   #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
   module Database where

   import Data.Time

   data DatabaseItem = DbString String
                     | DbNumber Integer
                     | DbDate   UTCTime
                     deriving (Eq, Ord, Show)

   theDatabase :: [DatabaseItem]
   theDatabase =
     [ DbDate (UTCTime (fromGregorian 1911 5 1) (secondsToDiffTime 34123))
     , DbNumber 9001
     , DbString "Hello, world!"
     , DbDate (UTCTime (fromGregorian 1921 5 1) (secondsToDiffTime 34123))
     ]
   #+END_SRC

   1. Write a function that filters for DbDate values and returns a
      list of the UTCTime values inside them.
      #+NAME: Database
      #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
      filterDbDate :: [DatabaseItem] -> [UTCTime]
      filterDbDate db = foldr accumulateDates [] db
        where accumulateDates item times =
                case item of
                  DbDate time -> time : times
                  _ -> times
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post start-at-line(content=*this*, line=4)
      <<add-current-chapter-directory-in-path()>>
      :load Database
      filterDbDate theDatabase
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      [1911-05-01 09:28:43 UTC,1921-05-01 09:28:43 UTC]
      #+END_EXAMPLE

   2. Write a function that filters for DbNumber values and returns a
      list of the Integer values inside them.
      #+NAME: Database
      #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
      filterDbNumber :: [DatabaseItem] -> [Integer]
      filterDbNumber db = foldr accumulateNumbers [] db
        where accumulateNumbers item numbers =
                case item of
                  DbNumber n -> n : numbers
                  _ -> numbers
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post start-at-line(content=*this*, line=4)
      <<add-current-chapter-directory-in-path()>>
      :load Database
      filterDbNumber theDatabase
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      [9001]
      #+END_EXAMPLE

   3. Write a function that gets the most recent date.
      #+NAME: Database
      #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
      mostRecent :: [DatabaseItem] -> UTCTime
      mostRecent = maximum . filterDbDate
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post start-at-line(content=*this*, line=4)
      <<add-current-chapter-directory-in-path()>>
      :load Database
      mostRecent theDatabase
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      1921-05-01 09:28:43 UTC
      #+END_EXAMPLE

   4. Write a function that sums all of the DbNumber values.
      #+NAME: Database
      #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
      sumDb :: [DatabaseItem] -> Integer
      sumDb = sum . filterDbNumber
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post start-at-line(content=*this*, line=4)
      <<add-current-chapter-directory-in-path()>>
      :load Database
      sumDb theDatabase
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      9001
      #+END_EXAMPLE

   5. Write a function that gets the average of the DbNumber values.
      #+NAME: Database
      #+BEGIN_SRC haskell :eval never :tangle chapter-010/Database.hs
      avgDb :: [DatabaseItem] -> Double
      avgDb theDatabase = (fromIntegral (sum numbers)) / (fromIntegral (length numbers))
        where numbers = (filterDbNumber theDatabase)
      #+END_SRC

      #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post start-at-line(content=*this*, line=4)
      <<add-current-chapter-directory-in-path()>>
      :load Database
      avgDb theDatabase
      #+END_SRC

      #+RESULTS:
      #+BEGIN_EXAMPLE
      9001.0
      #+END_EXAMPLE

* 10.09 Scans

  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load"
  :t foldr
  :t foldl
  :t scanr
  :t scanl
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  foldr :: Foldable t => (a -> b -> b) -> b -> t a -> b
  foldl :: Foldable t => (b -> a -> b) -> b -> t a -> b
  scanr :: (a -> b -> b) -> b -> [a] -> [b]
  scanl :: (b -> a -> b) -> b -> [a] -> [b]
  #+END_EXAMPLE

  - The reduce function is the same as ~fold*~
  - The traversal of the spine is the same as ~fold*~
  - They are not catamorphisms in the sense that they not fold
  - Always returns a list of intermediate results of folding so far
  - Unfortunately ~scan*~ works only on lists and not on generic ~Foldable~ things

  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load"
  scanr (+) 0 [1..3]
  scanl (+) 0 [1..3]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [6,5,3,0]
  [0,1,3,6]
  #+END_EXAMPLE

  Implementation of ~scanr~
  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
  :{
  scanr :: (a -> b -> b) -> b -> [a] -> [b]
  scanr _ z [] = [z]
  scanr f z (x:xs) = (f x (head rest)) : rest
    where rest = scanr f z xs
  :}
  scanr (+) 0 [1..3]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [6,5,3,0]
  #+END_EXAMPLE

  Implementation of ~scanl~
  #+BEGIN_SRC haskell :results output :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
  :{
  scanl :: (b -> a -> b) -> b -> [a] -> [b]
  scanl _ z [] = [z]
  scanl f z (x:xs) = z : (scanl f (f z x) xs)
  :}
  scanl (+) 0 [1..3]
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [0,1,3,6]
  #+END_EXAMPLE

  Example of execution of ~scanr~
  #+BEGIN_EXAMPLE
  scanr (+) 0 [1, 2, 3]
  1 + (head (scanr (+) 0 [2, 3])) : (scanr (+) 0 [2, 3])
  1 + (head (2 + (head (scanr (+) 0 [3])) : (scanr (+) [3]))) : (2 + (head (scanr (+) 0 [3])) : (scanr (+) [3]))
  1 + (head (2 + (head (3 + (head (scanr (+) 0 [])) : (scanr (+) 0 []))) : (3 + (head (scanr (+) 0 [])) : (scanr (+) 0 [])))) : (2 + (head (3 + (head (scanr (+) 0 [])) : (scanr (+) 0 []))) : (3 + (head (scanr (+) 0 [])) : (scanr (+) 0 []))
  1 + (head (2 + (head (3 + (head [0]) : [0])) : (3 + (head [0]) : [0]))) : (2 + (head (3 + (head [0]) : [0])) : (3 + (head [0]) : [0]))
  1 + (head (2 + (head (3 + 0 : [0])) : (3 + 0 : [0]))) : (2 + (head (3 + 0 : [0])) : (3 + 0 : [0]))
  1 + (head (2 + (head (3 : [0])) : (3 : [0]))) : (2 + (head (3 : [0])) : (3 : [0]))
  1 + (head (2 + (head ([3, 0])) : ([3, 0]))) : (2 + (head ([3, 0])) : ([3, 0]))
  1 + (head (2 + 3 : ([3, 0]))) : (2 + 3 : ([3, 0]))
  1 + (head (5 : ([3, 0]))) : (5 : ([3, 0]))
  1 + (head ([5, 3, 0])) : [5, 3, 0]
  1 + 5 : [5, 3, 0]
  6 : [5, 3, 0]
  [6, 5, 3, 0]
  #+END_EXAMPLE

  With ~scanl~ we can obtain an infinite list of fibonacci numbers
  #+NAME: fibs
  #+BEGIN_SRC haskell :eval never
  fibs = 1 : scanl (+) 1 fibs
  #+END_SRC

  #+BEGIN_SRC haskell :results output :noweb yes :wrap EXAMPLE :epilogue ":load" :post ghci-clean(content=*this*)
  <<fibs>>
  take 10 fibs
  fibs !! 9
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  [1,1,2,3,5,8,13,21,34,55]
  55
  #+END_EXAMPLE

